Repository: argrath/activitystreams
Catalog: omegat/omegat/project_save.tmx
Source language: en
Languages: ja

source: Please see the Working Group's implementation report.
ja: Working Group の implementation report を参照のこと。

source: Please send them to public-socialweb@w3.org (subscribe, archives).
ja: public-socialweb@w3.org(購読,アーカイブ)に送ってほしい。

source: Properties of the Link are properties of the reference as opposed to properties of the resource.
ja: Link の属性は、このリソースの属性ではなく 参照先の属性である。

source: Properties:
ja: 属性:

source: Property
ja: 属性

source: RFC 5988 defines that all Links have a "link relation" that describes the contextual purpose of the link.
ja: RFC 5988では、すべての"Link"には、リンクのコンテキスト目的を記述する「リンク関係」があると定義される。

source: Refer to the Activity Streams 2.0 Core specification for a complete description of the Collection type.
ja: Collectionタイプの詳細な説明については、Activity Streams 2.0 Core仕様を参照のこと。

source: Refer to the Activity Streams 2.0 Core for a complete description of the CollectionPage object.
ja: CollectionPageオブジェクトの詳細な説明については、Activity Streams 2.0 Coreを参照のこと。

source: Refer to the Activity Streams 2.0 Core for a complete description of the OrderedCollectionPage object.
ja: OrderedCollectionPageオブジェクトの詳細な説明については、Activity Streams 2.0 Coreを参照のこと。

source: Relative IRI (and URL) references SHOULD NOT be used within an Activity Streams 2.0 document due to the fact that many JSON parser implementations are not capable of reliably preserving the base context necessary to properly resolve relative references.
ja: 相対 IRI (及び URL) 参照は Activity Streams 2.0 文書の中で 使うべきではない(SHOULD NOT); 多くの JSON パーサ実装は、相対参照を適切に解決するために必要な 基底コンテキストを確実に保存する能力を持たないからである。

source: Removal of activity types and object types that weren't core to social use cases
ja: ソーシャルなユースケースの中心でないアクティビティ型とオブジェクト型の削除

source: Removed process sections, especially those noting exit criteria and at-risk features.
ja: 処理の節、特に終了基準とリスクのある機能に言及している部分を削除した。

source: Removed the four normative relationship values for lack of implementation.
ja: 実装がないため、四つの規範的なrelationship値を削除した。

source: Represents a Web Page.
ja: Web ページを表現する。

source: Represents a document of any kind.
ja: あらゆる種類の文書を表現する。

source: Represents a logical or physical location.
ja: 論理的または物理的な場所を表現する。

source: Represents a short written work typically less than a single paragraph in length.
ja: 典型的には 1 段落未満の短い文章を表現する。

source: Represents a video document of any kind.
ja: あらゆる種類の映像を表現する。

source: Represents an audio document of any kind.
ja: あらゆる種類の音声を表現する。

source: Represents any kind of event.
ja: あらゆる種類のイベントを表現する。

source: Represents any kind of multi-paragraph written work.
ja: 複数段落からなるようなあらゆる種類の文章を表現する。

source: Resources that use the "application/activity+json" Media Type are required to conform to all of the requirements for the "application/json" Media Type and are therefore subject to the same encoding considerations specified in Section 11 of [RFC7159].
ja: "application/activity+json"メディア型を使用するリソースは、"application/json"メディア型のすべての要件に準拠する必要があるため、[RFC7159]の11章で指定されているのと同じエンコーディングの考慮事項に従う。

source: See 5.2 Representing Relationships Between Entities for additional information.
ja: 追加情報については 5.2 Representing Relationships Between Entities を参照のこと。

source: See 5.3 Representing Places for additional information.
ja: 追加の情報については 5.3 Representing Places を参照のこと。

source: See Section 7 of [ RFC3986].
ja: [RFC3986]の7章を参照のこと。

source: See Section 8 of [ RFC3987].
ja: [RFC3987]の8章を参照のこと。

source: See the Extensibility section for more information on handling extensions within Activity Streams 2.0 documents.
ja: Activity Streams 2.0 文書の中での拡張の扱いに関するさらなる情報については Extensibility 節を参照のこと。

source: Set the domain of the first, last, and current properties to Collection.
ja: first、last、およびcurrent属性のドメインをCollectionに設定した。

source: Several properties defined by the Vocabulary are defined as having natural language values.
ja: Vocabulary で定義されている属性のいくつかは自然言語値を持つと定義されている。

source: Simple GeoJSON Points, for instance, can be mapped to Place objects, while more complex geometries can be converted to GeoSparql "Well-Known Text" representations as illustrated in the non-normative examples below:
ja: 例えば、単純なGeoJSONポイントはPlaceオブジェクトにマップすることができ、より複雑なジオメトリはGeoSparqlの"Well-Known Text"表現に変換できる。

source: Some additional details about the article, actor and target blog are given using properties defined by the Activity Streams 2.0 Vocabulary.
ja: Activity Streams 2.0 Vocabulary によって定義された属性を使って、 記事、アクター、ターゲットに関するいくつかの追加の詳細が与えられている。

source: Some additional details about the article, actor and target blog are given using properties defined by the Activity Streams 2.0 Vocabulary:
ja: Activity Streams 2.0 Vocabulary によって定義された属性を使って、 記事、アクター、ターゲットに関するいくつかの追加の詳細が与えられている:

source: Some of the issues that specifically motivated the evolution of Activity Streams 2.0 from Activity Streams 1.0 include:
ja: 特に Activity Streams 1.0 から Activity Streams 2.0 への進化の動機となった 問題は次のようなものである:

source: Some popular extensions are included in the Activity Streams 2.0 namespace document, and can be reviewed at https://www.w3.org/ns/activitystreams#extensions.
ja: いくつかの一般的な拡張機能は、Activity Streams 2.0名前空間文書に含まれており、https://www.w3.org/ns/activitystreams#extensionsで確認できる。

source: Some portions of the original text of Activity Streams 1.0 are used in this document.
ja: この文書では、Activity Streams 1.0の原文の一部を使用している。

source: Specifically, Compact URIs can be used anywhere an IRI (or URI) value is expected.
ja: 特に、Compact URIはIRI(またはURI)値が想定されるどこでも使われる可能性がある。

source: Such expansion applies to all property names as well as all property values explicitly defined as type @id in the JSON-LD @context.
ja: このような展開は、JSON-LDの@contextで@id型として明示的に定義されている全ての属性名および属性値に適用される。

source: That is, any given Object cannot also be a Link.
ja: つまり、任意のObjectはLinkになることはできない。

source: The "URI" in the above grammar refers to the "URI" as defined in Section 3 of [RFC3986].
ja: 上記の文法での "URI" は [RFC3986] の Section 3 で定義される "URI" を参照する。

source: The "profile" media type parameter MUST be quoted.
ja: "profile" メディアタイプ引数はクォートされなければならない(MUST)。

source: The "time-hour", "time-minute", "time-second", "time-secfrac", "time-offset" and "full-date" constructs are as defined in [ RFC3339].
ja: "time-hour", "time-minute", "time-second", "time-secfrac", "time-offset", "full-date" 構造は [RFC3339] で定義される。

source: The CollectionPage type extends from the base Collection type and inherits all of it's properties.
ja: CollectionPage 型は基底 Collection 型から拡張され、 その全ての属性を継承する。

source: The OrderedCollectionPage type extends from both CollectionPage and OrderedCollection .
ja: OrderedCollectionPage 型は CollectionPage と OrderedCollection の両方を拡張する。

source: The Object is the primary base type for the Activity Streams vocabulary.
ja: Objectは Activity Streams vocabulary の基本基底クラスである。

source: The name property SHOULD be derived from input by the creator or another user.
ja: name 属性は 作成者または他のユーザーによる入力から生成されるべきである(SHOULD)。

source: The origin and target properties of an Activity respectively identify the entities from which and to which the action is directed.
ja: Activity の origin と target 属性は、それぞれアクションが向けられる from と to エンティティを識別する。

source: The subject and object properties are used to identify the connected individuals.
ja: subject と object 属性が つながった個人を識別するために使われる。

source: The summary property SHOULD be used as a fallback text representation, possibly automatically generated by the publisher.
ja: summary 属性は、おそらく発行者によって自動的に生成される、 フォールバックテキスト表現として使われるべきである(SHOULD)。

source: The to, cc, bto and bcc properties MAY be used within an Object to explicitly identify the Primary and Secondary audiences.
ja: to, cc, bto and bcc 属性を 主要関係者と補助関係者を明示的に識別するために Object の中で使ってもよい(MAY)。

source: The Activity Vocabulary defines a range of Object types that are common to many social Web applications.
ja: Activity Vocabulary は 多くのソーシャル Web アプリケーションで一般的である、幅広い Object 型を定義する。

source: The Activity Vocabulary defines a small number of Activity types that are common to many social Web applications.
ja: Activity Vocabulary は 多くのソーシャル Web アプリケーションで一般的である、少数の Activity 型を定義する。

source: The Activity Vocabulary defines three properties that use natural language values: name, summary, and content.
ja: Activity Vocabulary は 自然言語値を使う三つの属性を定義している: name, summary, content.

source: The Activity Vocabulary normatively defines the core object types and properties for Activity Streams 2.0.
ja: Activity Vocabulary は Activity Streams 2.0 のためのコアオブジェクトと属性を形式的に定義している。

source: The current property identifies a page containing the subset of items in the Collection that have been created or updated most recently.
ja: current 属性は、Collection の中で、 最も最近に作成または更新されたアイテムの部分集合を含むページを識別する。

source: The first, next, prev, last, and current properties are used to reference other CollectionPage instances that contain additional subsets of items from the parent collection.
ja: first, next, prev, last, current 属性は、 親コレクションからのアイテムの追加の部分集合を含む、他の CollectionPage 実体を参照するために使われる。

source: The name and summary MAY be absent, MAY lack explicit values in the end user's current language, and MAY be longer than appropriate for use as a text representation of the Object in the current language context.
ja: name と summary はなくてもよく(MAY)、 エンドユーザーの現在の言語での明示的な値がなくてもよく(MAY)、 現在の言語コンテキストでの Object のテキスト表現として使うのに 適切でないぐらい長くてもよい(MAY)。

source: The partOf property identifies the Collection to which the items contained by the CollectionPage belong.
ja: partOf 属性は、 CollectionPage に含まれているアイテムが属する Collection を識別する。

source: The type property is used to identify the type of action the Activity Statement represents.
ja: type 属性は Activity Statement が表現するアクションの型を 識別するために使われる。

source: The mediaType property can be used in the object to indicate a different content type.
ja: 異なるコンテントタイプを示すためにこのオブジェクトに mediaType 属性を指定できる。

source: The Activity Vocabulary provides the normative definition of five specific types of Actors: Application | Group | Organization | Person | Service.
ja: Activity Vocabulary は Actor の 5 種類の特定の型の規定定義を提供する: Application | Group | Organization | Person | Service.

source: The Social Web Incubator Community Group maintains a wiki page on Activity Streams extensions.
ja: Social Web Incubator Community Groupは、Activity Streams Extensionsのwikiページを保守している。

source: The first property is used to identify the first page in this sequence, while the last property is used to identify the final page in the sequence.
ja: first 属性はこの並びの最初のページを識別するために使われ、 一方 last 属性は並びの最後のページを識別するのに使われる。

source: The OrderedCollection type MAY be used to identify a Collection whose items are always ordered.
ja: OrderedCollection 型は、 アイテムに常に順序がある Collection であることを識別するために使っても良い (MAY)。

source: The OrderedCollectionPage type MAY be used to identify a page whose items are strictly ordered.
ja: OrderedCollectionPage 型は アイテムが順序ありのもののページを識別するために使われる。

source: The object property is therefore inappropriate for these activities.
ja: 従って object 属性は これらのアクティビティにとっては不適切である。

source: The Activity type itself serves as an abstract base type for all types of activities.
ja: Activity 型自身は全てのアクティビティのための 抽象基底クラスである。

source: The foo extension is defined within the JSON-LD @context while the bar extension property is not.
ja: foo拡張はJSON-LD @contextの中で定義されているが、bar拡張属性は定義されていない。

source: The target property can be used in certain circumstances to indicate the context into which the object has been accepted.
ja: target 属性は、特定の状況では object が受け入れられたコンテキストを示すために使われる。

source: The prev and next properties identify the pages immediately before and immediately following, respectively.
ja: prev と next 属性はそれぞれ直前と直後のページを 識別する。

source: The target typically has no defined meaning.
ja: target は特に定義された意味は無い。

source: The Activity Streams 2.0 Core Types include:
ja: The Activity Streams 2.0 コア型は次のものからなる:

source: The Activity Streams 2.0 Extended Types include Activity and Object subtypes that are common to many social Web applications.
ja: Activity Streams 2.0 Extended Types は、 多くのソーシャル Web アプリケーションで一般的な Activity と Object の派生型を含む。

source: The Activity Streams 2.0 Vocabulary defines a set of abstract types and properties that describe past, present and future Activities.
ja: The Activity Streams 2.0 Vocabulary は、 過去、現在、未来のアクティビティを記述する抽象的な型と属性の集合を定義する。

source: The Activity Streams 2.0 specification is a product of the W3C Social Web Working Group.
ja: Activity Streams 2.0仕様は、W3CSocial Web Working Groupの成果物である。

source: The Activity Vocabulary Core Types provide the basis for the rest of the vocabulary.
ja: Activity Vocabulary コア型は他の語彙の基礎を提供する。

source: The JSON Activity Streams 1.0 [AS1] specification was published in May of 2011 and provided a baseline extensible syntax for the expression of completed activities.
ja: JSON Activity Streams 1.0 [AS1] 仕様は 2011 年 5 月に発行され、 完全なアクティビティの表現のための、基準となる拡張可能な文法を提供した。

source: The JSON-LD syntax supports the use of "Compact URIs".
ja: JSON-LD文法は、"Compact URI"に対応している。

source: The Object type serves as the base type for most of the other kinds of objects defined in the Activity Vocabulary, including other Core types such as Activity, IntransitiveActivity, Collection and OrderedCollection.
ja: Object 型は、 Activity, IntransitiveActivity, Collection, OrderedCollection のような他のコア型を含む、 Activity Vocabulary で定義されるその他の種類のオブジェクトの基底型を 提供する。

source: The appropriate interpretation of an omitted or explicitly null value is that no value has been assigned as opposed to the view that the given value is empty or nil.
ja: 省略されたか明示的な null 値の適切な解釈は、 値が設定されなかったか、与えられた値が空または nil であったかということである。

source: The associated values MUST be strings.
ja: 関連付けられた値は文字列でなければならない(MUST)。

source: The attributed entities might not be Actors.
ja: 起因する実体は Actor ではないかもしれない。

source: The author is very thankful for their significant contributions and gladly stands on their shoulders.
ja: 著者は彼らの多大な貢献に非常に感謝しており、喜んで彼らの肩の上に立っている。

source: The authors and the working group wished to avoid having implementers cut-and-paste examples from the document with explicit language markup as a template for new documents, which would consequently have inaccurate language markup.
ja: 著者とワーキンググループは、実装者が新しい文書のテンプレートとして明示的な言語マークアップを持つ文書から例をカットアンドペーストし、その結果、不正確な言語マークアップが含まれることになることを避けたいと望んだ。

source: The base direction of individual natural language values MAY be modified as described below.
ja: 個々の自然言語値の基本方向は後述のようにして修正してもよい(MAY)。

source: The common properties include: actor | attachment | attributedTo | audience | bcc | bto | cc | context | current | first | generator | icon | id | image | inReplyTo | instrument | last | location | items | oneOf | anyOf | closed | origin | next | object | prev | preview | result | replies | tag | target | to | type | url | accuracy | altitude | content | name | duration | height | href | hreflang | partOf | latitude | longitude | mediaType | endTime | published | startTime | radius | rel | startIndex | summary | totalItems | units | updated | width | subject | relationship | describes | formerType | deleted
ja: 一般的な属性は以下のものである: actor | attachment | attributedTo | audience | bcc | bto | cc | context | current | first | generator | icon | id | image | inReplyTo | instrument | last | location | items | oneOf | anyOf | closed | origin | next | object | prev | preview | result | replies | tag | target | to | type | url | accuracy | altitude | content | name | duration | height | href | hreflang | partOf | latitude | longitude | mediaType | endTime | published | startTime | radius | rel | startIndex | summary | totalItems | units | updated | width | subject | relationship | describes | formerType | deleted

source: The content MAY be expressed using multiple language-tagged values.
ja: content は複数の言語タグ付きの値を使って表現しても良い(MAY)。

source: The content or textual representation of the Object encoded as a JSON string.
ja: JSON string としてエンコードされた、Object の内容やテキスト表現。

source: The core Actor Types include:
ja: コアアクター型は次のものからなる:

source: The core types include:
ja: コア型は以下のものである:

source: The default base direction of an Activity Streams 2.0 document is Left-to-Right.
ja: Activity Streams 2.0 文書のデフォルト基本方向は左から右である。

source: The editor's also wish to thank all of those who contributed to Activity Streams prior to the specification being picked up as a contribution to the W3C Social Web Working Group.
ja: 編集者はまた、W3CSocial Web Working Groupへの貢献として仕様が取り上げられる前にActivity Streamsに貢献したすべての人々に感謝したい。

source: The editors thank all of the Working Group members who contributed to the conversations, issues and testing that helped shape the current specification.
ja: 編集者は、現在の仕様を形成するのに役立った会話、問題、テストに貢献したすべてのワーキンググループメンバーに感謝する。

source: The examples included in this document use the normative JSON serialization defined by this specification.
ja: この文書に含まれている例は、この使用で定義されている標準 JSON 直列化を 使用している。

source: The following additional properties can also be specified: partOf | next | prev |
ja: 以下の追加の属性も定義されている: partOf | next | prev |

source: The following illustrates an equivalent Activity Streams Note object:
ja: 以下に等価な Activity Streams Note オブジェクトを示す:

source: The following notable changes have been made to this document since the previous candidate recommendation of 2016-12-15.
ja: 前回の候補勧告2016-12-15以降、以下の注目すべき変更が本文書に加えられた。

source: The fundamental model for links is established by [ RFC5988].
ja: リンクの基本的なモデルは [[RFC5988]] で確立されている。

source: The generalized "Undo" activity type, so all activities can be undone
ja: 全てのアクティビティを取り消しできるようにするための一般化された "Undo" アクティビティ型

source: The intent is to provide a model that is at least semantically similar to attachments in email.
ja: 目的は、少なくとも意味論的にはEメールの添付と同様のモデルを 提供することである。

source: The items within a Collection can be ordered or unordered.
ja: Collection の中のアイテムは順序が ある場合とない場合がある。

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", " SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in [RFC2119].
ja: この文書における次の各キーワード「しなければならない(MUST)」、 「してはならない(MUST NOT)」、 「要求されている(REQUIRED)」、 「することになる(SHALL)」、 「することはない(SHALL NOT)」、 「する必要がある(SHOULD)」、 「しないほうがよい(SHOULD NOT)」、 「推奨される(RECOMMENDED)」、 「してもよい(MAY)」、 「選択できる(OPTIONAL)」は、 [RFC2119] で述べられているように解釈されるべきものである。

source: The link relation of the first is unspecified, while the link relation of the second is "thumbnail".
ja: 第1のリンク関係は未指定であり、第2のリンク関係は"thumbnail"である。

source: The name MAY be expressed using multiple language-tagged values.
ja: content は複数の言語タグ付きの値を使って表現しても良い(MAY)。

source: The object types defined by the vocabulary are segmented into a set of eight core types and an extended set of Activity and Object types common to many social Web applications.
ja: 語彙によって定義されたオブジェクト型は、八つのコア型と、 多くのソーシャル Web アプリケーションで共通に使われる Activity 型と Object 型の拡張集合に分けられる。

source: The official document is an English version.
ja: 正式な文書は英語版です。

source: The pages of an OrderedCollection SHOULD be instances of OrderedCollectionPage.
ja: ある OrderedCollection のページは OrderedCollectionPage の実体であるべきである(SHOULD)。

source: The properties of the Link object are not the properties of the referenced resource, but are provided as hints for rendering agents to understand how to make use of the resource.
ja: Link オブジェクトの属性は参照されたリソースの属性ではなく、 表示するエージェントがそのリソースをどのように使うかを理解するための ヒントとして提供される。

source: The property name term expands to http://example.org/term and the value ex:Foo expands to http://example.org/Foo
ja: 属性名termがhttp://example.org/termに展開され、値ex:Fooがhttp://example.org/Fooに展開される。

source: The scope of the link relation is the object in which the Link is an immediate child.
ja: リンク関係のスコープは、Linkが直接の子であるオブジェクトである。

source: The serialized JSON form of an Activity Streams 2.0 document MUST be consistent with what would be produced by the standard JSON-LD 1.0 Processing Algorithms and API [JSON-LD-API] Compaction Algorithm using, at least, the normative JSON-LD @context definition provided here.
ja: Activity Streams 2.0 文書の直列化された JSON 形式は、 少なくとも、ここ で提供されている規定の JSON-LD @context 定義を使って、 標準の JSON-LD 1.0 Processing Algorithms と API [JSON-LD-API] Compaction Algorithm で生成されるものと矛盾しないものでなければならない(MUST)。

source: The special language tag "und" can be used within the object form to explicitly identify a value whose language is unknown or undetermined.
ja: 特別な言語タグ "und" は、 言語が不明または未定義の値を明示的に識別するために オブジェクト形式の中で使用できる。

source: The target URI of the Link is expressed using the required href property.
ja: Link のターゲット URI は必須の href 属性を使って表現される。

source: The terms displayName, verb, title and objectType should be treated as reserved terms that SHOULD NOT be used within Activity Streams 2.0 documents.
ja: displayName, verb, title, objectType という用語は 予約語として扱われるべきであり、 Activity Streams 2.0 文書の中で使われるべきではない(SHOULD NOT)。

source: The value of the @context property is defined by the [JSON-LD] specification.
ja: @context 属性の値は [JSON-LD] 仕様で定義されている。

source: The values for the first, last, next, prev, and current properties can be either a single CollectionPage or a Link referencing a separate resource containing a CollectionPage .
ja: first, last, next, prev, current 属性は 単一の CollectionPage、 または CollectionPage を含む別のリソースを参照する Link である。

source: The vocabulary is defined in two parts:
ja: 語彙は二つの部分で定義される。

source: There are two special considerations: (1) when an IRI that is not also a URI is given for dereferencing, it MUST be mapped to a URI using the steps in Section 3.1 of [RFC3987] and (2) when an IRI is serving as an "id" value, it MUST NOT be so mapped.
ja: 特別に考慮することが二つある: (1) URI ではない IRI が逆参照として与えられた場合、 [RFC3987] の 3.1 節のステップを使って URI にマッピングしなければならず(MUST)、 (2) IRI が "id" 値として提供された場合、そのようにマッピングしてはならない(MUST NOT)。

source: Therefore, Compact URI use SHOULD be avoided in all cases other than property names and the value(s) of the type property.
ja: 従って、Compact URIの使用は、属性名とtype属性の値以外の全ての場合で避けるべきである(SHOULD)。

source: These are human-readable strings using one or more languages.
ja: これは、複数の言語を使った人間可読の文字列である。

source: These include: attachment | attributedTo | audience | content | context | contentMap | name | nameMap | endTime | generator | icon | image | inReplyTo | location | preview | published | replies | startTime | summary | summaryMap | tag | updated | url | to | bto | cc | bcc | mediaType | duration
ja: これは次のものである: attachment | attributedTo | audience | content | context | contentMap | name | nameMap | endTime | generator | icon | image | inReplyTo | location | preview | published | replies | startTime | summary | summaryMap | tag | updated | url | to | bto | cc | bcc | mediaType | duration

source: These profile URIs have the identifier semantics defined in [RFC6906].
ja: これらのプロファイル URI は [RFC6906] で定義された意味論を持つ。

source: These representations are semantically equivalent.
ja: これらの表現は意味論的に等価である。

source: They are divided into three sets:
ja: これらは三つの集合に分類される:

source: This activity is illustrated in the example below:
ja: このアクティビティを以下に例示する:

source: This can be done using a string, object, or array.
ja: これは文字列、オブジェクト、配列を使って行える。

source: This can include constructing natural-language descriptions or visual representations about the activity, associating actionable information with various types of objects, communicating or recording activity logs, or delegation of potential actions to other applications.
ja: これには、アクティビティに関する自然言語記述やビジュアル表現の構築、 様々な型のオブジェクトと行動可能な情報の関連付け、 アクティビティログの通信や記録、 可能性のある行動の他のアプリケーションへの委譲を含む。

source: This document defines the vocabulary properties.
ja: この文書は語彙属性を定義する。

source: This document has been reviewed by W3C Members, by software developers, and by other W3C groups and interested parties, and is endorsed by the Director as a W3C Recommendation.
ja: この文書は、W3Cメンバー、ソフトウェア開発者、およびその他のW3Cグループと関係者によってレビューされ、W3C勧告としてディレクターによって承認されています。

source: This document is governed by the 1 March 2017 W3C Process Document.
ja: この文書は、1 March 2017 W3C Process Documentに準拠する。

source: This document may contain errors due to translations.
ja: この文書には翻訳による誤りが含まれることがあります。

source: This document was produced by a group operating under the 5 February 2004 W3C Patent Policy.
ja: この文書は、5 February 2004 W3C Patent Policyの下で活動しているグループによって作成された。
